---
kind: method
id: M:Autodesk.Revit.DB.ElementIsElementTypeFilter.#ctor(System.Boolean)
source: html/dfe9e7b3-2947-a71d-100c-60af07410d24.htm
---
# Autodesk.Revit.DB.ElementIsElementTypeFilter.#ctor Method

Constructs a new instance of a filter to match only ElementTypes, with the option to match all elements which are not ElementTypes.

## Syntax (C#)
```csharp
public ElementIsElementTypeFilter(
	bool inverted
)
```

## Parameters
- **inverted** (`System.Boolean`) - True if the filter should match all elements which are not ElementTypes.